Revit 2024 API
MechanicalSystemType.RiseDropSettings Property
 indicates the rise/drop symbol given the system type
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public RiseDropSymbol RiseDropSettings { get; set; }
Visual Basic
Public Property RiseDropSettings As RiseDropSymbol
	Get
	Set
Visual C++
public:
property RiseDropSymbol RiseDropSettings {
	RiseDropSymbol get ();
	void set (RiseDropSymbol value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The input is not a valid HVAC rise/drop symbol type.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
MechanicalSystemType Class
Autodesk.Revit.DB.Mechanical Namespace